avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
/* SPDX-License-Identifier: MIT
 * Copyright (C) 2026 Avnet
 * Authors: Nikola Markovic <nikola.markovic@avnet.com> et al.
 */

/*
 * Signaling layer.
 *
 * Step 5a (GetSignalingChannelEndpoint, REST), Step 5b URL signing
 * (signaling_build_signed_url) and the WSS upgrade + wslay event-loop glue
 * (signaling_connect / signaling_wait_for_offer / signaling_disconnect) are
 * implemented. S6b reinstates signaling_send_answer / signaling_send_ice_candidate
 * as queued wslay sends drained by signaling_tick.
 *
 * KVS role: we connect as MASTER. Role names describe the signaling-channel
 * topology, not media direction — a camera streaming video out is the master
 * (sits and waits for browser "viewers" to publish offers).
 *
 * GetSignalingChannelEndpoint flow:
 *   1. Signaling_ConstructGetSignalingChannelEndpointRequest  — builds URL + body
 *   2. SigV4_GenerateHTTPAuthorization                       — builds Authorization header
 *   3. iotconnect_https_request_with_opts                    — POST, returns JSON
 *   4. Signaling_ParseGetSignalingChannelEndpointResponse    — extracts WSS endpoint
 *
 * ConnectAsMaster URL-signing flow (signaling_build_signed_url):
 *   1. Signaling_ConstructConnectWssEndpointRequest  — builds the unsigned base URL
 *   2. Build canonical query string with X-Amz-* params (URI-encoded, lex-sorted)
 *   3. SigV4_GenerateHTTPAuthorization                — signs the canonical request
 *   4. Append &X-Amz-Signature=<sig> to the query
 */

#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <time.h>

#include "FreeRTOS.h"
#include "queue.h"
#include "semphr.h"
#include "task.h"

#include "mbedtls/base64.h"
#include "mbedtls/sha1.h"
#include "mbedtls/sha256.h"

/* Must precede sigv4.h: SigV4's sigv4_config_defaults.h defines LogError
 * et al. as no-ops via #ifndef. Pre-define them via our shim so SigV4
 * skips its defaults and uses our printf-backed implementation. */
#include "logging.h"

#include "sigv4.h"
#include "signaling_api.h"

#include "iotcl_certs.h"
#include "iotcl_dra_url.h"
#include "iotc_http_client.h"

#include "cy_tcpip_port_secure_sockets.h"
#include "transport_interface.h"

#include "wslay/wslay.h"

#include "csprng.h"
#include "peer_connection.h"
#include "signaling.h"

// -------------------------------------------------------------------------
// Buffer sizes
// -------------------------------------------------------------------------

// Full URL from the Signaling lib.
// 5a (HTTPS): "https://kinesisvideo.<region>.amazonaws.com/..." — ~80 chars.
// 5b base URL (WSS, master): "wss://<host>?X-Amz-ChannelARN=<arn>"
// Host ~50, ARN ~110 → up to ~200. 384 leaves comfortable room.
#define SIG_URL_BUF         384

// JSON body for GetSignalingChannelEndpoint — ARN + protocol/role fields.
// ARN is ~80 chars; total body is well under 512.
#define SIG_BODY_BUF        512

// ISO 8601 date: "YYYYMMDDTHHMMSSz" — exactly 16 chars + null.
#define SIG_DATE_ISO_LEN    17

// Authorization header value output from SigV4_GenerateHTTPAuthorization.
// "AWS4-HMAC-SHA256 Credential=.../kinesisvideo/aws4_request, SignedHeaders=..., Signature=<64>"
// Real KVS values run ~380-450 chars; 1024 leaves comfortable headroom.
#define SIG_AUTH_BUF        1024

// KVS service name for SigV4.
#define KVS_SERVICE         "kinesisvideo"
#define KVS_SERVICE_LEN     (sizeof(KVS_SERVICE) - 1)

// Overhead bytes in the canonical headers string beyond the three variable
// fields (host, date, token): field names + colons + newlines + null.
// "host:\nx-amz-date:\nx-amz-security-token:\n\0" = ~57 chars; 64 is safe.
#define SIG_CANON_HDR_OVERHEAD 64

// KVS senderClientId is uuid-shaped (~36 chars). 64 covers any drift; bigger
// would be wasted in a struct that lives for the connection lifetime.
#define SIG_CLIENT_ID_MAX 64
#define SIG_WS_MUTEX_TIMEOUT_MS 500U

// WSS keepalive. KVS signaling endpoints drop connections that go application-
// idle for somewhere in the 60–90 s range. Send a WSS PING every 30 s while
// the connection is up; the peer auto-PONGs per RFC 6455 and the connection
// stays warm across long browser-idle gaps between viewer sessions. Fires
// from both wait_for_offer (idle waiting for a viewer) and signaling_tick
// (during media pump — WSS itself is idle since ICE/SRTP run over UDP).
#define SIG_KEEPALIVE_PING_INTERVAL_MS 30000U

// Outbox queue depth. Producers (signaling_send_answer,
// signaling_send_ice_candidate, called from peer-connection's session task
// when local ICE candidates appear) drop pre-formed WSS envelopes here;
// signaling_tick (webrtc task) drains them under the wslay lock. Sized for
// the worst-case offer-and-trickle burst (one answer + several candidates
// in quick succession) without ever forcing a producer to wait.
#define SIG_OUTBOX_DEPTH 16U

// Early ICE candidate buffer depth. KVS delivers the SDP offer and the viewer's
// already-gathered trickle candidates in a single burst, all consumed inside
// signaling_wait_for_offer — before the peer session is attached. We stash those
// candidates here and replay them via signaling_flush_early_candidates() once the
// orchestrator has attached the session and run SetRemoteDescription. Chrome
// typically emits well under a dozen host/srflx candidates up front; 32 is ample.
#define SIG_EARLY_ICE_MAX 32U

// WSS upgrade transport constants.
#define WSS_PORT 443
#define WSS_RFC6455_GUID "258EAFA5-E914-47DA-95CA-C5AB0DC85B11"
#define WSS_NONCE_LEN 16
#define WSS_NONCE_B64_LEN 25  /* base64(16) = 24 + null */
#define WSS_ACCEPT_B64_LEN 29 /* base64(SHA1=20) = 28 + null */

// Per-call socket timeouts (ms). These are set once at cy_awsport_network_connect
// time and apply to every send/recv after that — the secure-sockets API has no
// way to retune them later. A short recv timeout is what lets the wslay event
// loop poll without blocking forever; a 0 from cy_awsport_network_receive maps
// cleanly to WSLAY_ERR_WOULDBLOCK so the loop can yield and retry.
//
// The handshake recv has to gather a multi-part response, so it loops up to
// WSS_HANDSHAKE_BUDGET_MS of wall-clock time, swallowing per-call timeouts.
#define WSS_SOCK_SEND_TIMEOUT_MS 2000U
#define WSS_SOCK_RECV_TIMEOUT_MS 200U
#define WSS_HANDSHAKE_BUDGET_MS 5000U

// Fixed overhead in the upgrade request: method/version/literal headers/CRLFs.
// "GET  HTTP/1.1\r\n" + Host: \r\n + Upgrade: websocket\r\n + Connection: Upgrade\r\n
// + Sec-WebSocket-Key: <24>\r\n + Sec-WebSocket-Version: 13\r\n + \r\n. ~150 bytes;
// 256 leaves headroom for accidental drift in the header set.
#define WSS_REQ_FIXED_OVERHEAD 256

// Response head only — we read until "\r\n\r\n" then stop. AWS' 101 response
// is ~200 bytes (a handful of headers); 1 KB is generous.
#define WSS_RESP_BUF_LEN 1024

