avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
#define SIG_ICE_URI_STUN  "stun:"
#define SIG_ICE_URI_TURNS "turns:"
#define SIG_ICE_URI_TURN  "turn:"
// KVS returns a small list of ICE server configs (typically 1-2), each with up
// to SIGNALING_ICE_SERVER_MAX_URIS URIs sharing one ephemeral user/password.
#define SIG_ICE_CFG_MAX 5U

// Parse "stun:<host>:<port>" / "turn[s]:<host>:<port>[?transport=udp|tcp]" into
// an IceControllerIceServer_t (host + port + type + protocol). The host is left
// unresolved (NUL-terminated) — the ICE controller does the DNS lookup. Returns
// 0 on success, -1 if the URI can't be parsed.
static int parse_ice_server_uri(IceControllerIceServer_t *srv, const char *uri, size_t uri_len) {
    const char *curr;
    const char *tail;
    const char *colon;

    if (uri_len > 5U && 0 == strncmp(uri, SIG_ICE_URI_STUN, 5U)) {
        srv->serverType = ICE_CONTROLLER_ICE_SERVER_TYPE_STUN;
        curr = uri + 5;
    } else if (uri_len > 6U && 0 == strncmp(uri, SIG_ICE_URI_TURNS, 6U)) {
        srv->serverType = ICE_CONTROLLER_ICE_SERVER_TYPE_TURNS;
        curr = uri + 6;
    } else if (uri_len > 5U && 0 == strncmp(uri, SIG_ICE_URI_TURN, 5U)) {
        srv->serverType = ICE_CONTROLLER_ICE_SERVER_TYPE_TURN;
        curr = uri + 5;
    } else {
        printf("[signaling] cannot parse ICE URI: %.*s\n", (int) uri_len, uri);
        return -1;
    }
    tail = uri + uri_len;

    colon = memchr(curr, ':', (size_t) (tail - curr));
    if (NULL == colon) {
        printf("[signaling] ICE URI missing ':port': %.*s\n", (int) uri_len, uri);
        return -1;
    }
    size_t host_len = (size_t) (colon - curr);
    if (0U == host_len || host_len >= ICE_CONTROLLER_ICE_SERVER_URL_MAX_LENGTH) {
        printf("[signaling] ICE URI host empty/too long\n");
        return -1;
    }
    memcpy(srv->url, curr, host_len);
    srv->url[host_len] = '\0';   // must be NUL-terminated for DNS lookup
    srv->urlLength = host_len;
    curr = colon + 1;

    const char *q = memchr(curr, '?', (size_t) (tail - curr));
    size_t port_len = (NULL == q) ? (size_t) (tail - curr) : (size_t) (q - curr);
    if (0U == port_len || port_len > 5U) {
        printf("[signaling] ICE URI bad port length\n");
        return -1;
    }
    uint32_t port = 0U;
    for (size_t i = 0; i < port_len; i++) {
        if (curr[i] < '0' || curr[i] > '9') {
            printf("[signaling] ICE URI non-numeric port\n");
            return -1;
        }
        port = (port * 10U) + (uint32_t) (curr[i] - '0');
    }
    if (0U == port || port > 65535U) {
        printf("[signaling] ICE URI port out of range: %u\n", (unsigned) port);
        return -1;
    }
    srv->iceEndpoint.transportAddress.port = (uint16_t) port;
    srv->iceEndpoint.isPointToPoint = 0U;
    curr += port_len;

    // Transport: TURN/TURNS carry ?transport=udp|tcp; STUN is always UDP.
    if (ICE_CONTROLLER_ICE_SERVER_TYPE_TURN == srv->serverType ||
        ICE_CONTROLLER_ICE_SERVER_TYPE_TURNS == srv->serverType) {
        if (curr < tail && 0 == strncmp(curr, "?transport=tcp", (size_t) (tail - curr))) {
            srv->protocol = ICE_SOCKET_PROTOCOL_TCP;
        } else {
            srv->protocol = ICE_SOCKET_PROTOCOL_UDP;   // default/explicit udp
        }
    } else {
        srv->protocol = ICE_SOCKET_PROTOCOL_UDP;
    }
    return 0;
}

int signaling_get_ice_servers(const AwsCreds *creds, IceControllerIceServer_t *out_servers, size_t *inout_count) {
    if (NULL == creds || NULL == out_servers || NULL == inout_count || *inout_count < 1U) {
        return -1;
    }

    const size_t cap = *inout_count;
    size_t out_idx = 0;

    // 1. Default regional STUN server at index 0 (no credentials, never
    //    expires). This alone yields a server-reflexive candidate.
    {
        IceControllerIceServer_t *stun = &out_servers[0];
        memset(stun, 0, sizeof(*stun));
        int n = snprintf(stun->url, sizeof(stun->url), "stun.kinesisvideo.%s.amazonaws.com", creds->region);
        if (n > 0 && (size_t) n < sizeof(stun->url)) {
            stun->urlLength = (size_t) n;
            stun->serverType = ICE_CONTROLLER_ICE_SERVER_TYPE_STUN;
            stun->protocol = ICE_SOCKET_PROTOCOL_UDP;
            stun->iceEndpoint.isPointToPoint = 0U;
            stun->iceEndpoint.transportAddress.port = 443U;
            out_idx = 1;
            printf("[signaling] ICE[0] STUN %s:443\n", stun->url);
        } else {
            printf("[signaling] failed to format default STUN URL\n");
        }
    }

    // 2. TURN relays via GetIceServerConfig. Needs the HTTPS endpoint + a
    //    client id. Any failure here is non-fatal: STUN-only still works for
    //    many topologies.
    if ('\0' == s_https_endpoint[0] || NULL == creds->client_id) {
        printf("[signaling] skipping TURN fetch (https_endpoint=%s client_id=%s)\n",
               ('\0' == s_https_endpoint[0]) ? "none" : "ok",
               (NULL == creds->client_id) ? "none" : "ok");
        *inout_count = out_idx;
        return (out_idx > 0) ? 0 : -1;
    }

    SignalingChannelEndpoint_t https_ep = {
        .pEndpoint = s_https_endpoint,
        .endpointLength = strlen(s_https_endpoint),
    };
    GetIceServerConfigRequestInfo_t req_info = {
        .channelArn = {
            .pChannelArn = creds->channel_arn,
            .channelArnLength = strlen(creds->channel_arn),
        },
        .pClientId = creds->client_id,
        .clientIdLength = strlen(creds->client_id),
    };
    SignalingRequest_t sig_req = {
        .pUrl = s_url_buf,
        .urlLength = sizeof(s_url_buf),
        .pBody = s_body_buf,
        .bodyLength = sizeof(s_body_buf),
    };
    SignalingResult_t sig_rc = Signaling_ConstructGetIceServerConfigRequest(&https_ep, &req_info, &sig_req);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructGetIceServerConfigRequest failed: %d (STUN-only)\n", (int) sig_rc);
        *inout_count = out_idx;
        return (out_idx > 0) ? 0 : -1;
    }

    IotclDraUrlContext url_ctx = {0};
    if (0 != iotcl_dra_url_init(&url_ctx, s_url_buf)) {
        printf("[signaling] ice: failed to parse URL: %s (STUN-only)\n", s_url_buf);
        *inout_count = out_idx;
        return (out_idx > 0) ? 0 : -1;
    }
    const char *host = iotcl_dra_url_get_hostname(&url_ctx);
    const char *path = iotcl_dra_url_get_resource(&url_ctx);
    if (NULL == host || NULL == path) {
        printf("[signaling] ice: URL missing host/path (STUN-only)\n");
        iotcl_dra_url_deinit(&url_ctx);
        *inout_count = out_idx;
        return (out_idx > 0) ? 0 : -1;
    }

    int rc_ret = (out_idx > 0) ? 0 : -1;
    char *canon_hdr_buf = NULL;
    IotConnectHttpResponse response = { 0 };

