avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    char date_iso[SIG_DATE_ISO_LEN];
    format_iso8601_now(date_iso);

    size_t canon_hdr_size = strlen(host) + sizeof(date_iso) + strlen(creds->session_token) + SIG_CANON_HDR_OVERHEAD;
    canon_hdr_buf = malloc(canon_hdr_size);
    if (NULL == canon_hdr_buf) {
        printf("[signaling] ice: OOM canon_hdr_buf (STUN-only)\n");
        goto ice_cleanup;
    }
    int hdr_len = snprintf(
        canon_hdr_buf, canon_hdr_size,
        "host:%s\n"
        "x-amz-date:%s\n"
        "x-amz-security-token:%s\n",
        host, date_iso, creds->session_token
    );
    if (hdr_len <= 0 || (size_t) hdr_len >= canon_hdr_size) {
        printf("[signaling] ice: canon_hdr overflow (STUN-only)\n");
        goto ice_cleanup;
    }

    SigV4CryptoInterface_t crypto = {
        .hashInit = sha256_init_cb,
        .hashUpdate = sha256_update_cb,
        .hashFinal = sha256_final_cb,
        .pHashContext = &s_sha_ctx,
        .hashBlockLen = 64,
        .hashDigestLen = 32,
    };
    SigV4Credentials_t sigv4_creds = {
        .pAccessKeyId = creds->access_key_id,
        .accessKeyIdLen = strlen(creds->access_key_id),
        .pSecretAccessKey = creds->secret_access_key,
        .secretAccessKeyLen = strlen(creds->secret_access_key),
    };
    SigV4HttpParameters_t http_params = {
        .pHttpMethod = "POST",
        .httpMethodLen = 4,
        .flags = SIGV4_HTTP_PATH_IS_CANONICAL_FLAG | SIGV4_HTTP_HEADERS_ARE_CANONICAL_FLAG,
        .pPath = path,
        .pathLen = strlen(path),
        .pQuery = NULL,
        .queryLen = 0,
        .pHeaders = canon_hdr_buf,
        .headersLen = (size_t) hdr_len,
        .pPayload = s_body_buf,
        .payloadLen = sig_req.bodyLength,
    };
    SigV4Parameters_t sigv4_params = {
        .pCredentials = &sigv4_creds,
        .pDateIso8601 = date_iso,
        .pAlgorithm = NULL,
        .algorithmLen = 0,
        .pRegion = creds->region,
        .regionLen = strlen(creds->region),
        .pService = KVS_SERVICE,
        .serviceLen = KVS_SERVICE_LEN,
        .pCryptoInterface = &crypto,
        .pHttpParameters = &http_params,
    };
    size_t auth_buf_len = SIG_AUTH_BUF;
    char *sig_ptr = NULL;
    size_t sig_len = 0;
    SigV4Status_t sv4_rc = SigV4_GenerateHTTPAuthorization(&sigv4_params, s_auth_buf, &auth_buf_len, &sig_ptr, &sig_len);
    if (SigV4Success != sv4_rc) {
        printf("[signaling] ice: SigV4 failed: %d (STUN-only)\n", (int) sv4_rc);
        goto ice_cleanup;
    }
    s_auth_buf[auth_buf_len] = '\0';

    IotConnectHttpHeader extra_headers[3] = {
        { .name = "Authorization",        .value = s_auth_buf },
        { .name = "x-amz-date",           .value = date_iso   },
        { .name = "x-amz-security-token", .value = (char *) creds->session_token },
    };
    IotConnectHttpOpts opts = {
        .ca_cert = (char *) IOTCL_AMAZON_ROOT_CA1,
        .cert = NULL,
        .key = NULL,
        .headers = extra_headers,
        .headers_len = 3,
    };
    unsigned int http_rc = iotconnect_https_request_with_opts(&response, host, path, s_body_buf, &opts);
    if (0 != http_rc || NULL == response.data) {
        printf("[signaling] ice: GetIceServerConfig HTTP failed: 0x%08x (STUN-only)\n", http_rc);
        goto ice_cleanup;
    }

    SignalingIceServer_t ice_cfgs[SIG_ICE_CFG_MAX];
    memset(ice_cfgs, 0, sizeof(ice_cfgs));
    size_t num_cfgs = SIG_ICE_CFG_MAX;
    sig_rc = Signaling_ParseGetIceServerConfigResponse(response.data, strlen(response.data), ice_cfgs, &num_cfgs);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ice: ParseGetIceServerConfigResponse failed: %d (STUN-only)\n", (int) sig_rc);
        goto ice_cleanup;
    }

    // Copy each TURN URI + its ephemeral creds into caller storage (the parsed
    // pointers alias response.data, which we free below).
    for (size_t i = 0; i < num_cfgs && out_idx < cap; i++) {
        for (size_t j = 0; j < ice_cfgs[i].urisNum && out_idx < cap; j++) {
            IceControllerIceServer_t *dst = &out_servers[out_idx];
            memset(dst, 0, sizeof(*dst));
            if (0 != parse_ice_server_uri(dst, ice_cfgs[i].pUris[j], ice_cfgs[i].urisLength[j])) {
                continue;
            }
            if (NULL != ice_cfgs[i].pUserName && ice_cfgs[i].userNameLength > 0U &&
                ice_cfgs[i].userNameLength < sizeof(dst->userName)) {
                memcpy(dst->userName, ice_cfgs[i].pUserName, ice_cfgs[i].userNameLength);
                dst->userName[ice_cfgs[i].userNameLength] = '\0';
                dst->userNameLength = ice_cfgs[i].userNameLength;
            }
            if (NULL != ice_cfgs[i].pPassword && ice_cfgs[i].passwordLength > 0U &&
                ice_cfgs[i].passwordLength < sizeof(dst->password)) {
                memcpy(dst->password, ice_cfgs[i].pPassword, ice_cfgs[i].passwordLength);
                dst->password[ice_cfgs[i].passwordLength] = '\0';
                dst->passwordLength = ice_cfgs[i].passwordLength;
            }
            printf("[signaling] ICE[%u] type=%d %s:%u proto=%d\n",
                   (unsigned) out_idx, (int) dst->serverType, dst->url,
                   (unsigned) dst->iceEndpoint.transportAddress.port, (int) dst->protocol);
            out_idx++;
        }
    }
    rc_ret = (out_idx > 0) ? 0 : -1;

ice_cleanup:
    iotcl_dra_url_deinit(&url_ctx);
    free(canon_hdr_buf);
    iotconnect_free_https_response(&response);
    *inout_count = out_idx;
    return rc_ret;
}

// -------------------------------------------------------------------------
// Step 5b — build SigV4-presigned ConnectAsMaster URL
// -------------------------------------------------------------------------

// Append a literal string fragment to a write cursor, advancing it. Returns 0
// on success, -1 if the fragment doesn't fit (including no room for the '\0'
// we'll write later — caller controls termination).
static int append_literal(char **cur, size_t *remain, const char *s) {
    size_t n = strlen(s);
    if (n >= *remain) {
        return -1;
    }
    memcpy(*cur, s, n);
    *cur += n;
    *remain -= n;
    return 0;
}

