avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
    printf("[signaling] presigned master URL ready (%d bytes)\n", (int)(prefix_len + query_len));
    return 0;

buf_too_small:
    printf("[signaling] presigned URL buffer too small (cap=%d)\n", (int) cap);
    return -1;
enc_fail:
    printf("[signaling] URI-encoding failed building presigned URL\n");
    return -1;
}

// -------------------------------------------------------------------------
// Step 5b — WSS handshake (HTTP/1.1 Upgrade)
// -------------------------------------------------------------------------
//
// We hand-roll the upgrade request and response parse rather than dragging in
// coreHTTP. The wire shape is small and well-defined; see RFC 6455 §1.3 / §4.
// After the 101 response is verified, the next session hands the still-open
// NetworkContext_t to wslay for frame I/O.
//
// Today's signaling_connect() opens the TLS connection, runs the upgrade,
// verifies Sec-WebSocket-Accept, then tears down. This proves the transport
// path end-to-end ahead of wiring wslay.


static void drain_outbox_locked(SignalingHandle sig);
static void maybe_queue_keepalive_ping_locked(SignalingHandle sig);

// Convert real CR/LF byte pairs in `in` to the 4-char JSON-escape form
// `\r\n` (backslash, 'r', backslash, 'n') and copy into `out`.
//
// Why: upstream's SDP serializer wraps the answer as
// `{"type":"answer","sdp":"<sdp body with literal \r\n bytes>"}`. That's
// invalid JSON — strings can't contain raw control characters per RFC 8259.
// The browser-side JSON.parse throws SyntaxError before the message reaches
// the WebRTC API. Ameba's reference calls
// `SignalingController_SerializeSdpContentNewline` for the same reason;
// this is the inlined equivalent. Must be called BEFORE base64 / WSS
// envelope construction. The matching DeserializeSdpContentNewline isn't
// needed on the receive path because our SDP parser tolerates either form
// (verified — offer parsing works today).
//
// Output is up to ~2x input on lines that are pure CRLF; in practice
// (one CRLF per ~30-byte SDP line) growth is ~7%. Caller passes the
// buffer capacity in *out_len; on success *out_len is set to bytes written.
// Returns 0 on success, -1 on overflow.
static int escape_sdp_newlines(const char *in, size_t in_len,
                               char *out, size_t *out_len) {
    size_t i = 0;
    size_t o = 0;
    size_t cap = *out_len;
    while (i < in_len) {
        if (in[i] == '\r' && i + 1 < in_len && in[i + 1] == '\n') {
            if (o + 4 > cap) {
                return -1;
            }
            out[o++] = '\\';
            out[o++] = 'r';
            out[o++] = '\\';
            out[o++] = 'n';
            i += 2;
        } else if (in[i] == '\n') {
            if (o + 4 > cap) {
                return -1;
            }
            // Lone LF (no preceding CR) — emit as \r\n anyway for
            // consistency; browsers tolerate either inside JSON.
            out[o++] = '\\';
            out[o++] = 'r';
            out[o++] = '\\';
            out[o++] = 'n';
            i += 1;
        } else {
            if (o + 1 > cap) {
                return -1;
            }
            out[o++] = in[i++];
        }
    }
    *out_len = o;
    return 0;
}

static int signaling_lock(SignalingHandle sig, TickType_t wait_ticks) {
    if (NULL == sig || NULL == sig->ws_mutex) {
        return -1;
    }

    if (pdTRUE != xSemaphoreTake(sig->ws_mutex, wait_ticks)) {
        printf("[signaling] ws mutex timeout\n");
        return -1;
    }

    return 0;
}


static void signaling_unlock(SignalingHandle sig) {
    if (NULL != sig && NULL != sig->ws_mutex) {
        xSemaphoreGive(sig->ws_mutex);
    }
}


// Free any buffered early ICE candidates. Caller holds ws_mutex (or is the sole
// webrtc-task owner during teardown). Safe to call when the buffer is empty.
static void free_early_ice(SignalingHandle sig) {
    for (int i = 0; i < sig->early_ice_count; i++) {
        free(sig->early_ice[i]);
        sig->early_ice[i] = NULL;
    }
    sig->early_ice_count = 0;
}

void signaling_set_peer_connection(SignalingHandle sig, PeerConnectionSession_t *session) {
    if (NULL == sig) {
        return;
    }

    if (NULL != sig->ws_mutex) {
        if (0 != signaling_lock(sig, portMAX_DELAY)) {
            return;
        }
    }

    sig->peer_connection_session = session;
    // Detaching at viewer-session end: drop any early candidates that were
    // buffered but never flushed (e.g., the session failed before
    // SetRemoteDescription). They belong to the session that's going away.
    if (NULL == session) {
        free_early_ice(sig);
    }

    if (NULL != sig->ws_mutex) {
        signaling_unlock(sig);
    }
}

// Replay ICE candidates that arrived in the offer burst before the peer session
// was attached. Call once, right after PeerConnection_SetRemoteDescription (the
// remote ufrag/pwd from the offer must be known before candidates can pair).
// Runs on the webrtc task, sequentially with dispatch_text_frame, so it takes
// the ws_mutex to serialize against a candidate landing during the media pump.
void signaling_flush_early_candidates(SignalingHandle sig) {
    if (NULL == sig) {
        return;
    }
    if (0 != signaling_lock(sig, portMAX_DELAY)) {
        return;
    }
    if (NULL == sig->peer_connection_session || 0 == sig->early_ice_count) {
        signaling_unlock(sig);
        return;
    }
    int flushed = 0;
    for (int i = 0; i < sig->early_ice_count; i++) {
        PeerConnectionResult_t pc_rc = PeerConnection_AddRemoteCandidate(
            sig->peer_connection_session,
            (const char *) sig->early_ice[i],
            sig->early_ice_len[i]
        );
        if (PEER_CONNECTION_RESULT_OK != pc_rc &&
            PEER_CONNECTION_RESULT_FAIL_ICE_CONTROLLER_DESERIALIZE_CANDIDATE != pc_rc) {
            printf("[signaling] flush AddRemoteCandidate failed: %d\n", (int) pc_rc);
        } else {
            flushed++;
        }
        free(sig->early_ice[i]);
        sig->early_ice[i] = NULL;
    }
    printf("[signaling] flushed %d/%d buffered ICE candidate(s)\n", flushed, sig->early_ice_count);
    sig->early_ice_count = 0;
    signaling_unlock(sig);
}

// Split a "wss://<host>/<path-and-query>" URL into a malloc'd host and a
// path pointer (into the original buffer, after the host). On success the
// caller must free *out_host. Returns 0 on success, -1 on malformed URL.
static int wss_url_split(const char *url, char **out_host, const char **out_path) {
    if (0 != strncmp(url, "wss://", 6)) {
        printf("[signaling] not a wss:// URL\n");
        return -1;
    }
    const char *host_start = url + 6;
    const char *path_start = strchr(host_start, '/');
    if (NULL == path_start) {
        printf("[signaling] wss URL missing path\n");
        return -1;
    }
    size_t host_len = (size_t)(path_start - host_start);
    if (0 == host_len) {
        printf("[signaling] wss URL has empty host\n");
        return -1;
    }
    char *host = malloc(host_len + 1);
    if (NULL == host) {
        return -1;
    }
    memcpy(host, host_start, host_len);
    host[host_len] = '\0';
    *out_host = host;
    *out_path = path_start;
    return 0;
}

