avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
// Compute the expected Sec-WebSocket-Accept value: base64(SHA1(client_key + GUID)).
// out must be at least WSS_ACCEPT_B64_LEN. Returns 0 on success.
static int wss_compute_accept(const char *client_key_b64, char *out, size_t out_size) {
    unsigned char concat[WSS_NONCE_B64_LEN - 1 + sizeof(WSS_RFC6455_GUID) - 1];
    size_t key_len = strlen(client_key_b64);
    if (key_len + sizeof(WSS_RFC6455_GUID) - 1 > sizeof(concat)) {
        return -1;
    }
    memcpy(concat, client_key_b64, key_len);
    memcpy(concat + key_len, WSS_RFC6455_GUID, sizeof(WSS_RFC6455_GUID) - 1);

    unsigned char sha1[20];
    if (0 != mbedtls_sha1(concat, key_len + sizeof(WSS_RFC6455_GUID) - 1, sha1)) {
        return -1;
    }
    size_t out_len = 0;
    if (0 != mbedtls_base64_encode((unsigned char *) out, out_size, &out_len, sha1, sizeof(sha1))) {
        return -1;
    }
    return 0;
}

// Read response head into resp_buf until "\r\n\r\n" or buffer full / wall-clock
// budget exceeded. The socket recv timeout is short (so the steady-state event
// loop can poll), so the handshake has to gather across multiple zero-returns.
// Returns the number of bytes read on success, -1 on error. The buffer is NOT
// null-terminated by this function; caller does that using the returned length.
static int wss_recv_head(NetworkContext_t *net, uint8_t *resp_buf, size_t resp_cap) {
    size_t total = 0;
    TickType_t start = xTaskGetTickCount();
    const TickType_t budget = pdMS_TO_TICKS(WSS_HANDSHAKE_BUDGET_MS);

    while (total < resp_cap) {
        if ((xTaskGetTickCount() - start) >= budget) {
            printf("[signaling] WSS upgrade recv timeout (budget %u ms)\n",
                   (unsigned) WSS_HANDSHAKE_BUDGET_MS);
            return -1;
        }
        int32_t n = cy_awsport_network_receive(net, resp_buf + total, resp_cap - total);
        if (n < 0) {
            printf("[signaling] cy_awsport_network_receive failed: %d\n", (int) n);
            return -1;
        }
        if (0 == n) {
            // Per-call timeout — keep polling until the wall-clock budget runs out.
            continue;
        }
        total += (size_t) n;
        if (total >= 4) {
            for (size_t i = 0; i + 3 < total; i++) {
                if (resp_buf[i]   == '\r' && resp_buf[i+1] == '\n'
                 && resp_buf[i+2] == '\r' && resp_buf[i+3] == '\n') {
                    return (int) total;
                }
            }
        }
    }
    printf("[signaling] WSS upgrade response head exceeded %d bytes\n", (int) resp_cap);
    return -1;
}

// Find a header line "<name>:" in the response (case-insensitive) and return a
// pointer to the value (skipping the colon and any leading whitespace), with
// *out_value_len set to the value length up to the line's CRLF. Returns NULL
// if not found. resp must point at the start of headers (after status line).
static const char *wss_find_header(const char *resp, size_t resp_len, const char *name, size_t *out_value_len) {
    size_t name_len = strlen(name);
    for (size_t i = 0; i + name_len < resp_len; ) {
        // Match "<name>:" case-insensitively at start of line.
        bool match = true;
        for (size_t j = 0; j < name_len; j++) {
            char a = resp[i + j];
            char b = name[j];
            // ASCII tolower
            if (a >= 'A' && a <= 'Z') a = (char)(a - 'A' + 'a');
            if (b >= 'A' && b <= 'Z') b = (char)(b - 'A' + 'a');
            if (a != b) { match = false; break; }
        }
        if (match && i + name_len < resp_len && resp[i + name_len] == ':') {
            // Skip colon + LWS.
            size_t v = i + name_len + 1;
            while (v < resp_len && (resp[v] == ' ' || resp[v] == '\t')) v++;
            // Find CRLF.
            size_t e = v;
            while (e + 1 < resp_len && !(resp[e] == '\r' && resp[e+1] == '\n')) e++;
            *out_value_len = e - v;
            return resp + v;
        }
        // Advance to next line.
        while (i + 1 < resp_len && !(resp[i] == '\r' && resp[i+1] == '\n')) i++;
        i += 2;
    }
    return NULL;
}

// -------------------------------------------------------------------------
// wslay event callbacks
// -------------------------------------------------------------------------
//
// All four callbacks share a single user_data pointer (a SignalingHandle).
// Recv/send wrap cy_awsport_network_*; genmask uses our DRBG; on_msg_recv
// latches the most recent text-frame payload into the handle for
// signaling_wait_for_offer to pick up.

static ssize_t wslay_recv_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_receive(&sig->net_ctx, buf, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock recv error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static ssize_t wslay_send_cb(wslay_event_context_ptr ctx, const uint8_t *data, size_t len,
                             int flags, void *user_data) {
    (void) flags;
    SignalingHandle sig = (SignalingHandle) user_data;
    int32_t n = cy_awsport_network_send(&sig->net_ctx, data, len);
    if (n < 0) {
        sig->transport_error = true;
        wslay_event_set_error(ctx, WSLAY_ERR_CALLBACK_FAILURE);
        printf("[sig] sock send error n=%d\n", (int) n);
        return -1;
    }
    if (0 == n) {
        wslay_event_set_error(ctx, WSLAY_ERR_WOULDBLOCK);
        return -1;
    }
    return (ssize_t) n;
}

static int wslay_genmask_cb(wslay_event_context_ptr ctx, uint8_t *buf, size_t len,
                            void *user_data) {
    (void) ctx;
    (void) user_data;
    if (0 != webrtc_csprng_bytes(buf, len)) {
        return -1;
    }
    return 0;
}

// Dispatch a single inbound text frame. Called from on_msg_recv, possibly
// multiple times per wslay_event_recv() call when KVS bursts frames. If the
// envelope is an SDP_OFFER, decode it into a freshly malloc'd buffer and
// install it as sig->pending_offer_sdp (replacing any prior unread offer).
// Anything else is dispatched (ICE_CANDIDATE) or logged and dropped.
static void dispatch_text_frame(SignalingHandle sig, const uint8_t *msg, size_t msg_len) {
    if (0 == msg_len) {
        return;
    }
    WssRecvMessage_t recv = { 0 };
    SignalingResult_t sig_rc = Signaling_ParseWssRecvMessage((const char *) msg, msg_len, &recv);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[sig] parse fail rc=%d len=%u\n", (int) sig_rc, (unsigned) msg_len);
        return;
    }

    // Per-frame decoded type. SignalingTypeMessage_t: 0=UNKNOWN, 1=SDP_OFFER,
    // 2=SDP_ANSWER, 3=ICE_CANDIDATE, 4=GO_AWAY, 5=RECONNECT_ICE_SERVER,
    // 6=STATUS_RESPONSE.
    // printf("[sig]   type=%d sender=%.*s\n",
    //        (int) recv.messageType,
    //        (int) recv.senderClientIdLength, recv.pSenderClientId ? recv.pSenderClientId : "");

    if (SIGNALING_TYPE_MESSAGE_ICE_CANDIDATE == recv.messageType) {
        // D4b: decode base64 payload + JSON-parse + feed to ICE controller.
        // Inbound ICE_CANDIDATE JSON shape mirrors what we send out:
        //   {"candidate":"<sdp body>","sdpMid":"0","sdpMLineIndex":0,
        //    "usernameFragment":"…"}
        // Payloads are small (Chrome's typical candidate is ~150-250 B
        // base64, ~110-180 B decoded). 512 B stack scratch is comfortable.
        if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
            return;
        }
        uint8_t payload[512];
        size_t decoded_len = 0;
        int b64_rc = mbedtls_base64_decode(
            payload, sizeof(payload), &decoded_len,
            (const unsigned char *) recv.pBase64EncodedPayload,
            recv.base64EncodedPayloadLength);
        if (0 != b64_rc) {
            printf("[signaling] ICE_CANDIDATE base64 decode failed: -0x%04x (len=%u)\n",
                   -b64_rc, (unsigned) recv.base64EncodedPayloadLength);
            return;
        }
        if (NULL == sig->peer_connection_session) {
            // Offer + trickle candidates arrive together before the orchestrator
            // attaches the session. Buffer (don't drop) so we can replay them
            // after SetRemoteDescription; otherwise ICE has no remote candidates
            // to pair with and the connection never completes (black video).
            if (sig->early_ice_count < (int) SIG_EARLY_ICE_MAX) {
                uint8_t *copy = malloc(decoded_len);
                if (NULL != copy) {
                    memcpy(copy, payload, decoded_len);
                    sig->early_ice[sig->early_ice_count] = copy;
                    sig->early_ice_len[sig->early_ice_count] = decoded_len;
                    sig->early_ice_count++;
                    printf("[signaling] buffered early ICE candidate #%d (%u bytes)\n",
                           sig->early_ice_count, (unsigned) decoded_len);
                } else {
                    printf("[signaling] OOM buffering early ICE candidate\n");
                }
            } else {
                printf("[signaling] early ICE buffer full (%u), dropping candidate\n",
                       (unsigned) SIG_EARLY_ICE_MAX);
            }
            return;
        }

