avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
        PeerConnectionResult_t pc_rc = PeerConnection_AddRemoteCandidate(
            sig->peer_connection_session,
            (const char *) payload,
            decoded_len
        );
        if (
            PEER_CONNECTION_RESULT_OK != pc_rc &&
            PEER_CONNECTION_RESULT_FAIL_ICE_CONTROLLER_DESERIALIZE_CANDIDATE != pc_rc
        ) {
            printf("[signaling] PeerConnection_AddRemoteCandidate failed: %d\n", (int) pc_rc);
        }
        return;
    }

    if (SIGNALING_TYPE_MESSAGE_SDP_OFFER != recv.messageType) {
        // GO_AWAY / RECONNECT_ICE_SERVER / STATUS_RESPONSE land later.
        return;
    }

    if (NULL == recv.pBase64EncodedPayload || 0 == recv.base64EncodedPayloadLength) {
        printf("[signaling] SDP_OFFER missing messagePayload\n");
        return;
    }

    // Decode into a freshly malloc'd buffer sized to the base64 payload. mbedtls
    // gives back at most (b64_len * 3 / 4) bytes, and the JSON-unescape pass
    // only shrinks the result, so this cap is safe.
    size_t scratch_cap = (recv.base64EncodedPayloadLength * 3U) / 4U + 4U;
    char *scratch = malloc(scratch_cap);
    if (NULL == scratch) {
        printf("[signaling] OOM allocating SDP_OFFER scratch (%u bytes)\n", (unsigned) scratch_cap);
        return;
    }

    size_t decoded_len = 0;
    int b64_rc = mbedtls_base64_decode(
        (unsigned char *) scratch, scratch_cap - 1, &decoded_len,
        (const unsigned char *) recv.pBase64EncodedPayload,
        recv.base64EncodedPayloadLength
    );
    if (0 != b64_rc) {
        printf("[signaling] base64 decode of SDP_OFFER payload failed: -0x%04x\n", -b64_rc);
        free(scratch);
        return;
    }
    scratch[decoded_len] = '\0';

    // The base64-decoded payload is a JSON envelope: {"type":"offer","sdp":"<sdp>"}.
    // Chrome / KVS escapes \r and \n inside the SDP as the two-byte literal
    // sequences \r and \n. Unwrap + un-escape in place so callers see real
    // SDP with real CR/LF.
    char *p = strstr(scratch, "\"sdp\":\"");
    if (NULL == p) {
        printf("[signaling] SDP_OFFER envelope missing \"sdp\" key\n");
        free(scratch);
        return;
    }
    p += 7;     // past `"sdp":"`
    char *dst = scratch;
    const char *src = p;
    const char *end = scratch + decoded_len;
    bool closed = false;
    while (src < end) {
        char c = *src++;
        if ('\\' == c && src < end) {
            char esc = *src++;
            switch (esc) {
                case 'r':  *dst++ = '\r'; break;
                case 'n':  *dst++ = '\n'; break;
                case 't':  *dst++ = '\t'; break;
                case '"':  *dst++ = '"';  break;
                case '\\': *dst++ = '\\'; break;
                case '/':  *dst++ = '/';  break;
                default:
                    // Unknown escape — keep literal so we can spot it in logs.
                    *dst++ = '\\';
                    *dst++ = esc;
                    break;
            }
        } else if ('"' == c) {
            // Closing quote of the "sdp" value.
            closed = true;
            break;
        } else {
            *dst++ = c;
        }
    }
    if (!closed) {
        printf("[signaling] SDP_OFFER envelope: unterminated \"sdp\" string\n");
        free(scratch);
        return;
    }
    size_t sdp_len = (size_t)(dst - scratch);
    scratch[sdp_len] = '\0';

    // Latch sender client id last, only after the offer payload is known good,
    // so a malformed offer doesn't corrupt the routing for the next valid one.
    if (recv.senderClientIdLength >= sizeof(sig->peer_client_id)) {
        printf("[signaling] senderClientId too long (%u >= %u)\n",
               (unsigned) recv.senderClientIdLength, (unsigned) sizeof(sig->peer_client_id));
        free(scratch);
        return;
    }

    // Install as the pending offer. Newest wins — replace any prior unread
    // offer; the older viewer is no longer reachable through it.
    if (NULL != sig->pending_offer_sdp) {
        printf("[signaling] replacing unread pending SDP_OFFER (%u bytes) with newer (%u bytes)\n",
               (unsigned) sig->pending_offer_len, (unsigned) sdp_len);
        free(sig->pending_offer_sdp);
    }
    sig->pending_offer_sdp = scratch;
    sig->pending_offer_len = sdp_len;

    if (recv.senderClientIdLength > 0) {
        memcpy(sig->peer_client_id, recv.pSenderClientId, recv.senderClientIdLength);
    }
    sig->peer_client_id[recv.senderClientIdLength] = '\0';
    sig->peer_client_id_len = recv.senderClientIdLength;
}

static void wslay_on_msg_recv_cb(wslay_event_context_ptr ctx,
                                 const struct wslay_event_on_msg_recv_arg *arg,
                                 void *user_data) {
    (void) ctx;
    SignalingHandle sig = (SignalingHandle) user_data;

    if (wslay_is_ctrl_frame(arg->opcode)) {
        // wslay handles ping/close/pong queueing itself; just log for triage.
        if (WSLAY_CONNECTION_CLOSE == arg->opcode) {
            printf("[signaling] WS close (status=%u, len=%u)\n",
                   (unsigned) arg->status_code, (unsigned) arg->msg_length);
        }
        return;
    }

    // One line per WS frame is useful flow tracing for Increment D bring-up
    // (ICE controller wiring). messageType is decoded in dispatch_text_frame.
    // printf("[sig] frame op=0x%x len=%u\n",
    //        (unsigned) arg->opcode, (unsigned) arg->msg_length);
    dispatch_text_frame(sig, arg->msg, arg->msg_length);
}

static const struct wslay_event_callbacks g_wslay_cbs = {
    wslay_recv_cb,
    wslay_send_cb,
    wslay_genmask_cb,
    NULL,                   // on_frame_recv_start
    NULL,                   // on_frame_recv_chunk
    NULL,                   // on_frame_recv_end
    wslay_on_msg_recv_cb,
};


SignalingHandle signaling_connect(const char *signed_url) {
    if (NULL == signed_url) {
        return NULL;
    }
    if (g_sig.connected) {
        printf("[signaling] signaling_connect called while already connected\n");
        return NULL;
    }

