avnet-iotconnect/avnet-iotc-mtb-psoc-edge-aivision-webrtc/proj_cm33_ns/webrtc/algorithm/signaling.c
        if (NULL == consumed) {
            // Yield. The recv callback already blocks up to
            // WSS_SOCK_RECV_TIMEOUT_MS, but want_read may be 0 (e.g., right
            // after a control-frame round trip), so a small extra yield
            // keeps this loop cooperative.
            vTaskDelay(pdMS_TO_TICKS(20));
            continue;
        }

        // Hand the offer out. consumed_len excludes the trailing NUL that
        // dispatch_text_frame wrote at scratch[sdp_len]; require room for that
        // NUL in the caller's buffer.
        if (consumed_len + 1U > out_sdp_cap) {
            printf("[sig] caller offer buffer too small: have %u, need %u\n",
                   (unsigned) out_sdp_cap, (unsigned) (consumed_len + 1U));
            free(consumed);
            rc = -1;
            goto out;
        }
        memcpy(out_sdp, consumed, consumed_len);
        out_sdp[consumed_len] = '\0';
        *out_sdp_len = consumed_len;
        free(consumed);
        rc = 0;
        goto out;
    }

out:
    printf("[sig] wait_for_offer exit rc=%d\n", rc);
    return rc;
}

// Move every queued envelope into wslay's own internal TX list. Caller must
// hold ws_mutex — we touch wslay state. wslay_event_queue_msg copies the
// payload, so the envelope buffer is safe to free immediately after.
static void drain_outbox_locked(SignalingHandle sig) {
    if (NULL == sig->outbox_queue || NULL == sig->ws_ctx) {
        return;
    }
    SignalingOutboxItem_t item;
    while (pdTRUE == xQueueReceive(sig->outbox_queue, &item, 0)) {
        struct wslay_event_msg ws_msg = {
            .opcode     = WSLAY_TEXT_FRAME,
            .msg        = item.envelope,
            .msg_length = item.len,
        };
        int wrc = wslay_event_queue_msg(sig->ws_ctx, &ws_msg);
        if (0 != wrc) {
            printf("[signaling] wslay_event_queue_msg failed: %d (envelope %u bytes dropped)\n",
                   wrc, (unsigned) item.len);
        }
        free(item.envelope);
    }
}

// Queue an empty WSS PING control frame if SIG_KEEPALIVE_PING_INTERVAL_MS has
// elapsed since the last one. Caller must hold ws_mutex (touches wslay state
// and sig->last_ping_tick).
static void maybe_queue_keepalive_ping_locked(SignalingHandle sig) {
    if (NULL == sig->ws_ctx) {
        return;
    }
    TickType_t now = xTaskGetTickCount();
    if ((now - sig->last_ping_tick) < pdMS_TO_TICKS(SIG_KEEPALIVE_PING_INTERVAL_MS)) {
        return;
    }
    struct wslay_event_msg ping = {
        .opcode     = WSLAY_PING,
        .msg        = NULL,
        .msg_length = 0,
    };
    int wrc = wslay_event_queue_msg(sig->ws_ctx, &ping);
    if (0 != wrc) {
        // Failure here isn't fatal — next tick retries. Don't bump
        // last_ping_tick so we try again immediately.
        printf("[sig] keepalive PING queue failed: %d\n", wrc);
        return;
    }
    sig->last_ping_tick = now;
}

int signaling_tick(SignalingHandle sig) {
    if (NULL == sig || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }

    if (0 != signaling_lock(sig, pdMS_TO_TICKS(SIG_WS_MUTEX_TIMEOUT_MS))) {
        return -1;
    }

    if (!sig->connected || NULL == sig->ws_ctx) {
        signaling_unlock(sig);
        return -1;
    }
    if (sig->transport_error) {
        signaling_unlock(sig);
        return -1;
    }
    maybe_queue_keepalive_ping_locked(sig);
    drain_outbox_locked(sig);
    if (wslay_event_want_write(sig->ws_ctx)) {
        int wrc = wslay_event_send(sig->ws_ctx);
        if (0 != wrc) {
            printf("[sig] tick: wslay_event_send rc=%d\n", wrc);
            signaling_unlock(sig);
            return -1;
        }
    }
    if (wslay_event_want_read(sig->ws_ctx)) {
        int wrc = wslay_event_recv(sig->ws_ctx);
        if (0 != wrc) {
            printf("[sig] tick: wslay_event_recv rc=%d\n", wrc);
            signaling_unlock(sig);
            return -1;
        }
    }
    bool transport_error = sig->transport_error;
    bool peer_closed = !wslay_event_want_read(sig->ws_ctx) && !wslay_event_want_write(sig->ws_ctx);
    signaling_unlock(sig);
    if (transport_error) {
        return -1;
    }
    if (peer_closed) {
        // Peer closed cleanly.
        printf("[sig] tick: peer close (read+write disabled)\n");
        return -1;
    }
    return 0;
}


int signaling_send_answer(SignalingHandle sig, const char *sdp_answer) {
    char peer_client_id[SIG_CLIENT_ID_MAX];
    size_t peer_client_id_len;

    if (NULL == sig || NULL == sdp_answer || !sig->connected || NULL == sig->ws_ctx) {
        printf("[signaling] send_answer: bad args or not connected (sig=%p, sdp=%p, connected=%d, ws=%p)\n",
               (void*)sig, (void*)sdp_answer, sig ? (int)sig->connected : -1, sig ? (void*)sig->ws_ctx : NULL);
        return -1;
    }

    // peer_client_id is written exactly once per session (dispatch_text_frame
    // when the SDP_OFFER lands, under the wslay lock) and never mutated again
    // until signaling_disconnect. Producers (this function, send_ice_candidate)
    // only fire AFTER signaling_wait_for_offer returned, so the bytes are
    // already stable by the time we get here — safe to snapshot without a
    // lock, and importantly we don't have to wait on the wslay-state mutex
    // that signaling_tick holds across blocking TLS I/O.
    if (sig->transport_error) {
        printf("[signaling] send_answer: transport already in error\n");
        return -1;
    }
    peer_client_id_len = sig->peer_client_id_len;
    if (peer_client_id_len == 0 || peer_client_id_len >= sizeof(peer_client_id)) {
        printf("[signaling] send_answer: peer_client_id not yet set (len=%u)\n",
               (unsigned) peer_client_id_len);
        return -1;
    }
    memcpy(peer_client_id, sig->peer_client_id, peer_client_id_len);
    peer_client_id[peer_client_id_len] = '\0';

    size_t sdp_len = strlen(sdp_answer);

    // Escape CRLF byte pairs to JSON `\r\n` escape sequences (4 bytes each)
    // before encoding. See escape_sdp_newlines() rationale. Worst-case 2x
    // growth, plus headroom for the wrapping JSON skeleton already in
    // sdp_answer.
    size_t escaped_cap = (sdp_len * 2U) + 16U;
    char *escaped_buf = malloc(escaped_cap);
    if (NULL == escaped_buf) {
        printf("[signaling] OOM for escaped SDP buffer (%u bytes)\n", (unsigned) escaped_cap);
        return -1;
    }
    size_t escaped_len = escaped_cap;
    if (0 != escape_sdp_newlines(sdp_answer, sdp_len, escaped_buf, &escaped_len)) {
        printf("[signaling] escape_sdp_newlines overflow (cap=%u)\n", (unsigned) escaped_cap);
        free(escaped_buf);
        return -1;
    }

    // Base64-encode the escaped SDP. Output size is deterministic:
    // ceil(n/3)*4, plus mbedTLS uses one extra byte for an internal null
    // terminator in dlen.
    size_t b64_cap = 4 * ((escaped_len + 2) / 3) + 1;
    char *b64_buf = malloc(b64_cap);
    if (NULL == b64_buf) {
        printf("[signaling] OOM for base64 buffer (%u bytes)\n", (unsigned) b64_cap);
        free(escaped_buf);
        return -1;
    }
    size_t b64_len = 0;
    int b64_rc = mbedtls_base64_encode((unsigned char *) b64_buf, b64_cap, &b64_len,
                                       (const unsigned char *) escaped_buf, escaped_len);
    free(escaped_buf);
    if (0 != b64_rc) {
        printf("[signaling] base64 encode failed: -0x%04x\n", -b64_rc);
        free(b64_buf);
        return -1;
    }
    // Wrap in the KVS WSS send envelope. JSON skeleton (action/keys/braces/
    // quotes/commas) is ~80 bytes; flat 256 leaves headroom for KVS docs drift.
    size_t env_cap = b64_len + peer_client_id_len + 256;
    char *env_buf = malloc(env_cap);
    if (NULL == env_buf) {
        printf("[signaling] OOM for envelope buffer (%u bytes)\n", (unsigned) env_cap);
        free(b64_buf);
        return -1;
    }
    WssSendMessage_t send_msg = {
        .messageType                = SIGNALING_TYPE_MESSAGE_SDP_ANSWER,
        .pRecipientClientId         = peer_client_id,
        .recipientClientIdLength    = peer_client_id_len,
        .pBase64EncodedMessage      = b64_buf,
        .base64EncodedMessageLength = b64_len,
        .pCorrelationId             = NULL,
        .correlationIdLength        = 0,
    };
    size_t env_len = env_cap;
    SignalingResult_t sig_rc = Signaling_ConstructWssMessage(&send_msg, env_buf, &env_len);
    free(b64_buf);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructWssMessage failed: %d\n", (int) sig_rc);
        free(env_buf);
        return -1;
    }
    // Hand the envelope off to the webrtc task via the outbox queue.
    // signaling_tick (sole owner of wslay state) will pick it up, call
    // wslay_event_queue_msg, and free env_buf. Producer side never touches
    // wslay and never waits on TLS-write.
    SignalingOutboxItem_t item = { .envelope = (uint8_t *) env_buf, .len = env_len };
    if (pdTRUE != xQueueSend(sig->outbox_queue, &item, 0)) {
        printf("[signaling] send_answer: outbox full, dropping (%u bytes)\n", (unsigned) env_len);
        free(env_buf);
        return -1;
    }
    printf("[signaling] send_answer: queued (%u bytes), signaling_tick will drain it\n", (unsigned) env_len);
    return 0;
}

int signaling_send_ice_candidate(
    SignalingHandle sig,
    const char *candidate,
    const char *sdp_mid,
    int sdp_m_line_index
) {
    char peer_client_id[SIG_CLIENT_ID_MAX];
    size_t peer_client_id_len;

    if (NULL == sig || NULL == candidate || NULL == sdp_mid
        || !sig->connected || NULL == sig->ws_ctx) {
        return -1;
    }

    // peer_client_id snapshot rationale: see signaling_send_answer.
    if (sig->transport_error) {
        printf("[signaling] send_ice_candidate: transport already in error\n");
        return -1;
    }
    peer_client_id_len = sig->peer_client_id_len;
    if (peer_client_id_len == 0 || peer_client_id_len >= sizeof(peer_client_id)) {
        printf("[signaling] send_ice_candidate: peer_client_id not yet set (len=%u)\n",
               (unsigned) peer_client_id_len);
        return -1;
    }
    memcpy(peer_client_id, sig->peer_client_id, peer_client_id_len);
    peer_client_id[peer_client_id_len] = '\0';

    /* Build the inner JSON payload that the browser's signaling layer parses
     * into RTCIceCandidateInit. The senderClientId / messagePayload envelope
     * the upstream lib adds wraps this. */
    size_t cand_len = strlen(candidate);
    size_t mid_len  = strlen(sdp_mid);
    /* Skeleton: {"candidate":"","sdpMid":"","sdpMLineIndex":N} ~ 50 B + N digits. */
    size_t json_cap = cand_len + mid_len + 64;
    char *json_buf = malloc(json_cap);
    if (NULL == json_buf) {
        printf("[signaling] OOM for ice candidate JSON (%u bytes)\n", (unsigned) json_cap);
        return -1;
    }
    int json_len = snprintf(json_buf, json_cap,
        "{\"candidate\":\"%s\",\"sdpMid\":\"%s\",\"sdpMLineIndex\":%d}",
        candidate, sdp_mid, sdp_m_line_index);
    if (json_len <= 0 || (size_t) json_len >= json_cap) {
        printf("[signaling] ice candidate JSON overflow\n");
        free(json_buf);
        return -1;
    }

    size_t b64_cap = 4 * (((size_t) json_len + 2) / 3) + 1;
    char *b64_buf = malloc(b64_cap);
    if (NULL == b64_buf) {
        printf("[signaling] OOM for ice b64 buffer (%u bytes)\n", (unsigned) b64_cap);
        free(json_buf);
        return -1;
    }
    size_t b64_len = 0;
    int b64_rc = mbedtls_base64_encode((unsigned char *) b64_buf, b64_cap, &b64_len,
                                       (const unsigned char *) json_buf, (size_t) json_len);
    free(json_buf);
    if (0 != b64_rc) {
        printf("[signaling] ice candidate base64 encode failed: -0x%04x\n", -b64_rc);
        free(b64_buf);
        return -1;
    }

    size_t env_cap = b64_len + peer_client_id_len + 256;
    char *env_buf = malloc(env_cap);
    if (NULL == env_buf) {
        printf("[signaling] OOM for ice envelope (%u bytes)\n", (unsigned) env_cap);
        free(b64_buf);
        return -1;
    }
    WssSendMessage_t send_msg = {
        .messageType                = SIGNALING_TYPE_MESSAGE_ICE_CANDIDATE,
        .pRecipientClientId         = peer_client_id,
        .recipientClientIdLength    = peer_client_id_len,
        .pBase64EncodedMessage      = b64_buf,
        .base64EncodedMessageLength = b64_len,
        .pCorrelationId             = NULL,
        .correlationIdLength        = 0,
    };
    size_t env_len = env_cap;
    SignalingResult_t sig_rc = Signaling_ConstructWssMessage(&send_msg, env_buf, &env_len);
    free(b64_buf);
    if (SIGNALING_RESULT_OK != sig_rc) {
        printf("[signaling] ConstructWssMessage (ICE) failed: %d\n", (int) sig_rc);
        free(env_buf);
        return -1;
    }

    // Producer-side hand-off — see signaling_send_answer for the rationale.
    SignalingOutboxItem_t item = { .envelope = (uint8_t *) env_buf, .len = env_len };
    if (pdTRUE != xQueueSend(sig->outbox_queue, &item, 0)) {
        printf("[signaling] send_ice_candidate: outbox full, dropping (%u bytes)\n", (unsigned) env_len);
        free(env_buf);
        return -1;
    }

    return 0;
}
